
### :robot: Terraform Report
---
##### Plan: `1` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.control_plane will be created
  + resource "hcloud_server" "control_plane" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-22"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "nbg1"
      + name                       = "control-plane"
      + rebuild_protection         = false
      + server_type                = "cx31"
      + ssh_keys                   = [
          + "max",
        ]
      + status                     = (known after apply)
      + user_data                  = "OU7RHLvppnj4zcqDSkrD0u3YbhM="

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + control_plane_ipv4_address = (known after apply)

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#5777992369`](https://github.com/small-hack/modules-hetzner-tf-vm/actions/runs/5777992369) - commit efacf0956099cdb3e525d9048722d87fcdcaf899
